intermediaries/subscription-notification-service-intermediary/src/test/resources/xmlInstances/unSubscribeSoapRequest_noMatchingSID.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:b="http://docs.oasis-open.org/wsn/b-2" xmlns:add="http://www.w3.org/2005/08/addressing">
	<soapenv:Header>
		<add:Action>
			http://docs.oasis-open.org/wsn/bw-2/SubscriptionManager/UnsubscribeRequest
		</add:Action>
	</soapenv:Header>
	<soapenv:Body>
		<b:Unsubscribe xmlns:nc20="http://niem.gov/niem/niem-core/2.0"
			xmlns:um="http://ojbc.org/IEPD/Exchange/UnsubscriptionMessage/1.0"
			xmlns:smext="http://ojbc.org/IEPD/Extensions/Subscription/1.0"
			xmlns:b="http://docs.oasis-open.org/wsn/b-2" xmlns:add="http://www.w3.org/2005/08/addressing"
			xmlns:topics="http://ojbc.org/wsn/topics"
			xmlns:jxdm41="http://niem.gov/niem/domains/jxdm/4.1">
			<um:UnsubscriptionMessage>
				<smext:Subject>
					<jxdm41:PersonAugmentation>
						<jxdm41:PersonStateFingerprintIdentification>
							<nc20:IdentificationID>A88888888</nc20:IdentificationID>
						</jxdm41:PersonStateFingerprintIdentification>
					</jxdm41:PersonAugmentation>
				</smext:Subject>
				<nc20:ContactEmailID />
				<smext:SystemName>{http://demostate.gov/SystemNames/1.0}SystemA</smext:SystemName>
		        <smext:SubscriptionQualifierIdentification>
		            <nc20:IdentificationID>12345</nc20:IdentificationID>
		        </smext:SubscriptionQualifierIdentification>
			</um:UnsubscriptionMessage>
			<b:TopicExpression
				Dialect="http://docs.oasis-open.org/wsn/t-1/TopicExpression/Concrete">topics:person/arrest</b:TopicExpression>
		</b:Unsubscribe>
	</soapenv:Body>
</soapenv:Envelope>
